#### MultistoryLevelBelowTopbottomLevelError Property

---

|  |
| --- |
| BuiltInFailures StairRampFailures Class   See Also |

Multistory top level must be above the stair/ramp top and bottom levels.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId MultistoryLevelBelowTopbottomLevelError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MultistoryLevelBelowTopbottomLevelError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ MultistoryLevelBelowTopbottomLevelError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StairRampFailures Class

Autodesk.Revit.DB Namespace

#### KNPerMSup2 Property

---

|  |
| --- |
| SymbolTypeId Class   See Also |

Symbol kN/mÂ², indicating unit Kilonewtons per square meter.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId KNPerMSup2 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property KNPerMSup2 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ KNPerMSup2 { 	ForgeTypeId^ get (); } ``` |

# See Also

SymbolTypeId Class

Autodesk.Revit.DB Namespace

#### PreselectionColor Property

---

|  |
| --- |
| ColorOptions Class   See Also |

The color used to highlight candidates for selection before they are selected.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2020.1

# Syntax

| C# |
| --- |
| ``` public Color PreselectionColor { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property PreselectionColor As Color 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property Color^ PreselectionColor { 	Color^ get (); 	void set (Color^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

ColorOptions Class

Autodesk.Revit.DB Namespace

#### Lux Property

---

|  |
| --- |
| UnitTypeId Class   See Also |

Lux.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId Lux { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property Lux As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ Lux { 	ForgeTypeId^ get (); } ``` |

# See Also

UnitTypeId Class

Autodesk.Revit.DB Namespace

#### RbsElecApparentCurrentPhasebParam Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Apparent Current Phase B"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecApparentCurrentPhasebParam { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecApparentCurrentPhasebParam As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecApparentCurrentPhasebParam { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetSketchOnSurface Method

---

|  |
| --- |
| CurveByPointsUtils Class   See Also |

Gets the relationship between the CurveElement and face.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static bool GetSketchOnSurface( 	CurveElement curveElem ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetSketchOnSurface ( _ 	curveElem As CurveElement _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool GetSketchOnSurface( 	CurveElement^ curveElem ) ``` |

#### Parameters

curveElem
:   Type:  Autodesk.Revit.DB CurveElement
     The CurveElement.

#### Return Value

Whether or not the CurveElement should lie on the face and be able to be added to the face.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The input CurveElement is not a CurveByPoints. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

CurveByPointsUtils Class

Autodesk.Revit.DB Namespace

#### IsValidObject Property

---

|  |
| --- |
| ExternalResourceLoadContext Class   See Also |

Specifies whether the .NET object represents a valid Revit entity.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2014

# Syntax

| C# |
| --- |
| ``` public bool IsValidObject { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property IsValidObject As Boolean 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsValidObject { 	bool get (); } ``` |

#### Return Value

True if the API object holds a valid Revit native object, false otherwise.

# Remarks

If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone, a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.

# See Also

ExternalResourceLoadContext Class

Autodesk.Revit.DB Namespace

#### GeometryInstance Class

---

|  |
| --- |
| Members   See Also |

An instance of another element (symbol), specially positioned by this element.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public class GeometryInstance : GeometryObject ``` |

| Visual Basic |
| --- |
| ``` Public Class GeometryInstance _ 	Inherits GeometryObject ``` |

| Visual C++ |
| --- |
| ``` public ref class GeometryInstance : public GeometryObject ``` |

# Remarks

A GeometryInstance represents a set of geometry stored by Revit in a default configuration, and then transformed into the proper location as a result of the properties of the element. The most common situation where GeometryInstances are encountered is in Family instances. Revit uses GeometryInstances to allow it to store a single copy of the geometry for a given family and reuse it in multiple instances. Note that not all Family instances will include GeometryInstances. When Revit needs to make a unique copy of the family geometry for a given instance (because of the effect of local joins, intersections, and other factors related to the instance placement) no GeometryInstance will be encountered; instead the Solid geometry will be found at the top level of the hierarchy. Another example of GeometryInstance usage is in Rebar element visible in fine 3D Views. Here, each segement of a rebar is a GeometryInstance. In this case the Symbol Element is contaning all the geometries that are instanced. A GeometryInstance offers the ability to read its geometry through the GetSymbolGeometry() and GetInstanceGeometry() methods. These methods return another Autodesk.Revit.DB.GeometryElement which can be parsed just like the first level return.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB APIObject
  Autodesk.Revit.DB GeometryObject
  Autodesk.Revit.DB GeometryInstance

# See Also

GeometryInstance Members

Autodesk.Revit.DB Namespace

#### GetSplitRegionMaximum Method

---

|  |
| --- |
| ViewCropRegionShapeManager Class   See Also |

Returns the proportional location of the maximum boundary of the specified split crop region.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public double GetSplitRegionMaximum( 	int regionIndex ) ``` |

| Visual Basic |
| --- |
| ``` Public Function GetSplitRegionMaximum ( _ 	regionIndex As Integer _ ) As Double ``` |

| Visual C++ |
| --- |
| ``` public: double GetSplitRegionMaximum( 	int regionIndex ) ``` |

#### Parameters

regionIndex
:   Type:  System Int32
     Index of split crop region (numbering starts with 0).

#### Return Value

A value from 0 to 1 representing the maximum location for the region's split boundary. This number represents the location as a ratio along the non-split rectangular crop.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The provided region index is invalid. |

# See Also

ViewCropRegionShapeManager Class

Autodesk.Revit.DB Namespace

#### StructuralConnectionTypeChangedToGeneric Property

---

|  |
| --- |
| BuiltInFailures StructuralConnectionFailures Class   See Also |

Structural Connection had an inappropriate type, which has been changed to 'Generic Connection'.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId StructuralConnectionTypeChangedToGeneric { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralConnectionTypeChangedToGeneric As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ StructuralConnectionTypeChangedToGeneric { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures StructuralConnectionFailures Class

Autodesk.Revit.DB Namespace

#### SpaceTagType Property

---

|  |
| --- |
| SpaceTag Class   See Also |

The tag type.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public SpaceTagType SpaceTagType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SpaceTagType As SpaceTagType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property SpaceTagType^ SpaceTagType { 	SpaceTagType^ get (); 	void set (SpaceTagType^ value); } ``` |

# See Also

SpaceTag Class

Autodesk.Revit.DB.Mechanical Namespace

#### FittingParamsCauseGeometryToFailError Property

---

|  |
| --- |
| BuiltInFailures AutoRouteFailures Class   See Also |

The one of parameters for the fitting is causing the geometry to fail.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId FittingParamsCauseGeometryToFailError { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property FittingParamsCauseGeometryToFailError As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ FittingParamsCauseGeometryToFailError { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures AutoRouteFailures Class

Autodesk.Revit.DB Namespace

#### CeramicBumpMap Property

---

|  |
| --- |
| Ceramic Class   See Also |

The property labeled "Image" from the "Ceramic" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string CeramicBumpMap { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CeramicBumpMap As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ CeramicBumpMap { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.

# See Also

Ceramic Class

Autodesk.Revit.DB.Visual Namespace

#### GetAllExternalResourceReferences Method (Document, ExternalResourceType)

---

|  |
| --- |
| ExternalResourceUtils Class   See Also |

Gets the ids of all elements which refer to a specific type of external resource.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public static ISet<ElementId> GetAllExternalResourceReferences( 	Document document, 	ExternalResourceType resourceType ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function GetAllExternalResourceReferences ( _ 	document As Document, _ 	resourceType As ExternalResourceType _ ) As ISet(Of ElementId) ``` |

| Visual C++ |
| --- |
| ``` public: static ISet<ElementId^>^ GetAllExternalResourceReferences( 	Document^ document,  	ExternalResourceType^ resourceType ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The Revit Document containing the external resource references.

resourceType
:   Type:  Autodesk.Revit.DB ExternalResourceType
     The type of external resource.

#### Return Value

The ids of all elements which refer to external resources of the specified type.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

ExternalResourceUtils Class

GetAllExternalResourceReferences Overload

Autodesk.Revit.DB Namespace

#### AddMassLevelDataToMassInstance Method

---

|  |
| --- |
| MassInstanceUtils Class   See Also |

Create a MassLevelData (Mass Floor) to associate a Level with a mass instance.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public static ElementId AddMassLevelDataToMassInstance( 	Document document, 	ElementId massInstanceId, 	ElementId levelId ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function AddMassLevelDataToMassInstance ( _ 	document As Document, _ 	massInstanceId As ElementId, _ 	levelId As ElementId _ ) As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: static ElementId^ AddMassLevelDataToMassInstance( 	Document^ document,  	ElementId^ massInstanceId,  	ElementId^ levelId ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     The Document.

massInstanceId
:   Type:  Autodesk.Revit.DB ElementId
     The ElementId of the mass instance.

levelId
:   Type:  Autodesk.Revit.DB ElementId
     The ElementId of the Level to associate with the mass instance.

#### Return Value

The ElementId of the MassLevelData that was created, or the existing ElementId if it was already in added.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | The ElementId massInstanceId is not a mass instance. -or- The ElementId levelId is not a Level. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

MassInstanceUtils Class

Autodesk.Revit.DB Namespace

#### SketchGalleryOptions Property

---

|  |
| --- |
| PromptForFamilyInstancePlacementOptions Class   See Also |

The sketch option provided when promt to place a family instance.

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public SketchGalleryOptions SketchGalleryOptions { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property SketchGalleryOptions As SketchGalleryOptions 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property SketchGalleryOptions SketchGalleryOptions { 	SketchGalleryOptions get (); 	void set (SketchGalleryOptions value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

PromptForFamilyInstancePlacementOptions Class

Autodesk.Revit.UI Namespace

#### MinimumSampleHeight Property

---

|  |
| --- |
| CompoundStructure Class   See Also |

The minimum sample height determined by the current sample height and the horizontal segments.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public double MinimumSampleHeight { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property MinimumSampleHeight As Double 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property double MinimumSampleHeight { 	double get (); } ``` |

# Remarks

All horizontal segments dimensioned to the top must remain strictly above all horizontal segments dimensioned to the bottom.

# See Also

CompoundStructure Class

Autodesk.Revit.DB Namespace

#### BeamSystemTagParamLeft Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Left"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId BeamSystemTagParamLeft { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property BeamSystemTagParamLeft As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ BeamSystemTagParamLeft { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### InvalidWidth Property

---

|  |
| --- |
| BuiltInFailures ImageFailures Class   See Also |

The image width must be must be no more than 30000 feet.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)

# Syntax

| C# |
| --- |
| ``` public static FailureDefinitionId InvalidWidth { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property InvalidWidth As FailureDefinitionId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property FailureDefinitionId^ InvalidWidth { 	FailureDefinitionId^ get (); } ``` |

# See Also

BuiltInFailures ImageFailures Class

Autodesk.Revit.DB Namespace

#### StairsRailingBalusterSpacing Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Baluster Separation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsRailingBalusterSpacing { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsRailingBalusterSpacing As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsRailingBalusterSpacing { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Insert Method

---

|  |
| --- |
| PlanTopologySet Class   See Also |

Insert the specified item into the set.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual bool Insert( 	PlanTopology item ) ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function Insert ( _ 	item As PlanTopology _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: virtual bool Insert( 	PlanTopology^ item ) ``` |

#### Parameters

item
:   Type:  Autodesk.Revit.DB PlanTopology
     The item to be inserted into the set.

#### Return Value

Returns whether the item was inserted into the set.

# See Also

PlanTopologySet Class

Autodesk.Revit.DB Namespace

#### Reset Method

---

|  |
| --- |
| WireMaterialTypeSetIterator Class   See Also |

Bring the iterator back to the start of the set.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Reset() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Reset ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Reset() ``` |

#### Implements

 IEnumerator Reset

# Remarks

The Reset method will return the iterator back to the start of the set in line with the definition of IEnumerator. Note that you must call MoveNext before the first item can be accessed via the Current property.

# See Also

WireMaterialTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace

#### Reset Method

---

|  |
| --- |
| FormArrayIterator Class   See Also |

Bring the iterator back to the start of the array.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual void Reset() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Sub Reset ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Reset() ``` |

#### Implements

 IEnumerator Reset

# Remarks

The Reset method will return the iterator back to the start of the array in line with the definition of IEnumerator. Note that you must call MoveNext before the first item can be accessed via the Current property.

# See Also

FormArrayIterator Class

Autodesk.Revit.DB Namespace

#### SortParameters Method

---

|  |
| --- |
| GlobalParametersManager Class   See Also |

Sorts global parameters in the desired order.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static void SortParameters( 	Document document, 	ParametersOrder order ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Sub SortParameters ( _ 	document As Document, _ 	order As ParametersOrder _ ) ``` |

| Visual C++ |
| --- |
| ``` public: static void SortParameters( 	Document^ document,  	ParametersOrder order ) ``` |

#### Parameters

document
:   Type:  Autodesk.Revit.DB Document
     Document containing the global parameters to be sorted

order
:   Type:  Autodesk.Revit.DB ParametersOrder
     Desired sorting order

# Remarks

All global parameters are sorted, but only within the range of their respective parameter group.

This operation has no effect on the global parameters themselves. The sorted order is only visible in the standard Global Parameters dialog. However, the order of parameters is serialized in the document, thus available on the DB level as well.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentException | Global parameters are not supported in the given document. A possible cause is that it is not a project document, for global parameters are not supported in Revit families. |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also

GlobalParametersManager Class

Autodesk.Revit.DB Namespace

#### Schema Property

---

|  |
| --- |
| Entity Class   See Also |

The Schema describing this Entity.

**Namespace:**   Autodesk.Revit.DB.ExtensibleStorage
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2012

# Syntax

| C# |
| --- |
| ``` public Schema Schema { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Schema As Schema 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property Schema^ Schema { 	Schema^ get (); } ``` |

# See Also

Entity Class

Autodesk.Revit.DB.ExtensibleStorage Namespace

#### ReferenceArray Constructor

---

|  |
| --- |
| ReferenceArray Class   See Also |

Initializes a new instance of the  ReferenceArray  class

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public ReferenceArray() ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ``` |

| Visual C++ |
| --- |
| ``` public: ReferenceArray() ``` |

# See Also

ReferenceArray Class

Autodesk.Revit.DB Namespace

#### RebarSystemSpanactiveDirn1 Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Bars In Major Direction"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarSystemSpanactiveDirn1 { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarSystemSpanactiveDirn1 As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarSystemSpanactiveDirn1 { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### ManyWarnings Method

---

|  |
| --- |
| ConnectionValidationInfo Class   See Also |

Returns number of warnings generated by reload.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
  **Since:**  2016

# Syntax

| C# |
| --- |
| ``` public int ManyWarnings() ``` |

| Visual Basic |
| --- |
| ``` Public Function ManyWarnings As Integer ``` |

| Visual C++ |
| --- |
| ``` public: int ManyWarnings() ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also

ConnectionValidationInfo Class

Autodesk.Revit.DB Namespace

#### FamilyInstanceCreationData Constructor (XYZ, FamilySymbol, Level, StructuralType)

---

|  |
| --- |
| FamilyInstanceCreationData Class   See Also |

Initializes a new instance of the  FamilyInstanceCreationData  class

**Namespace:**   Autodesk.Revit.Creation
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public FamilyInstanceCreationData( 	XYZ location, 	FamilySymbol symbol, 	Level level, 	StructuralType structuralType ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub New ( _ 	location As XYZ, _ 	symbol As FamilySymbol, _ 	level As Level, _ 	structuralType As StructuralType _ ) ``` |

| Visual C++ |
| --- |
| ``` public: FamilyInstanceCreationData( 	XYZ^ location,  	FamilySymbol^ symbol,  	Level^ level,  	StructuralType structuralType ) ``` |

#### Parameters

location
:   Type:  Autodesk.Revit.DB XYZ
     The physical location where the instance is to be placed.

symbol
:   Type:  Autodesk.Revit.DB FamilySymbol
     A FamilySymbol object that represents the type of the instance that is to be inserted.

level
:   Type:  Autodesk.Revit.DB Level
     A Level object that is used as the base level for the object.

structuralType
:   Type:  Autodesk.Revit.DB.Structure StructuralType
     If structural then specify the type of the component.

# See Also

FamilyInstanceCreationData Class

FamilyInstanceCreationData Overload

Autodesk.Revit.Creation Namespace

#### BoundaryConditionFamilySymbolUserDefined Property

---

|  |
| --- |
| StructuralSettings Class   See Also |

The id of the FamilySymbol to represent a user-defined boundary condition.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public ElementId BoundaryConditionFamilySymbolUserDefined { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property BoundaryConditionFamilySymbolUserDefined As ElementId 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property ElementId^ BoundaryConditionFamilySymbolUserDefined { 	ElementId^ get (); 	void set (ElementId^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |
| Autodesk.Revit.Exceptions DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also

StructuralSettings Class

Autodesk.Revit.DB.Structure Namespace

#### RbsPipeFittingLossMethodSettings Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Loss Method Settings"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsPipeFittingLossMethodSettings { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsPipeFittingLossMethodSettings As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsPipeFittingLossMethodSettings { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### OBJExportOptions Class

---

|  |
| --- |
| Members   See Also |

The export options used by exporting to OBJ file format.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public class OBJExportOptions : ATFBaseExportOptions ``` |

| Visual Basic |
| --- |
| ``` Public Class OBJExportOptions _ 	Inherits ATFBaseExportOptions ``` |

| Visual C++ |
| --- |
| ``` public ref class OBJExportOptions : public ATFBaseExportOptions ``` |

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB ATFBaseExportOptions
  Autodesk.Revit.DB OBJExportOptions

# See Also

OBJExportOptions Members

Autodesk.Revit.DB Namespace

#### CommonTintToggle Property

---

|  |
| --- |
| WallPaint Class   See Also |

The property labeled "Tint" from the "WallPaint" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public static string CommonTintToggle { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property CommonTintToggle As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property String^ CommonTintToggle { 	String^ get (); } ``` |

# Remarks

This property is of type "AssetPropertyBoolean".

# See Also

WallPaint Class

Autodesk.Revit.DB.Visual Namespace

#### Current Property

---

|  |
| --- |
| EdgeArrayArrayIterator Class   See Also |

Retrieves the item that is the current focus of the iterator.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual Object Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As Object 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property Object^ Current { 	Object^ get (); } ``` |

#### Implements

 IEnumerator Current

# Remarks

A new or Reset iterator must have MoveNext called on it before Current will return a valid item as per expected behavior of IEnumerator.

# See Also

EdgeArrayArrayIterator Class

Autodesk.Revit.DB Namespace

#### RbsElecDistributionNodeSupplyFrom Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Supply From"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RbsElecDistributionNodeSupplyFrom { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RbsElecDistributionNodeSupplyFrom As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RbsElecDistributionNodeSupplyFrom { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### TextLabelType Property

---

|  |
| --- |
| AnalysisDisplayDeformedShapeSettings Class   See Also |

Type of deformed shape text visualization.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public AnalysisDisplayStyleDeformedShapeTextLabelType TextLabelType { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property TextLabelType As AnalysisDisplayStyleDeformedShapeTextLabelType 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property AnalysisDisplayStyleDeformedShapeTextLabelType TextLabelType { 	AnalysisDisplayStyleDeformedShapeTextLabelType get (); 	void set (AnalysisDisplayStyleDeformedShapeTextLabelType value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also

AnalysisDisplayDeformedShapeSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### GetCombinedParameters Method

---

|  |
| --- |
| ScheduleField Class   See Also |

Gets this field's combine parameter array if applicable

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public IList<TableCellCombinedParameterData> GetCombinedParameters() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetCombinedParameters As IList(Of TableCellCombinedParameterData) ``` |

| Visual C++ |
| --- |
| ``` public: IList<TableCellCombinedParameterData^>^ GetCombinedParameters() ``` |

#### Return Value

Gets array of TableCellCombinedParameterData with the combined parameters data

# See Also

ScheduleField Class

Autodesk.Revit.DB Namespace

#### StairsDbgShowLandingBoundary Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Show Landing Boundary"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StairsDbgShowLandingBoundary { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StairsDbgShowLandingBoundary As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StairsDbgShowLandingBoundary { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### GetHostId Method

---

|  |
| --- |
| RebarInSystem Class   See Also |

The element that contains the rebar.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ElementId GetHostId() ``` |

| Visual Basic |
| --- |
| ``` Public Function GetHostId As ElementId ``` |

| Visual C++ |
| --- |
| ``` public: ElementId^ GetHostId() ``` |

#### Return Value

The element that the rebar object belongs to, such as a structural wall, floor, foundation, beam, brace or column.

# See Also

RebarInSystem Class

Autodesk.Revit.DB.Structure Namespace

#### StructuralElevationAtBottomSurvey Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Elevation at Bottom Survey"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId StructuralElevationAtBottomSurvey { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property StructuralElevationAtBottomSurvey As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ StructuralElevationAtBottomSurvey { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### IsInactivePhaseload Property

---

|  |
| --- |
| TableCellStyle Class   See Also |

Gets or sets whether this is an inactive phase load cell.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public bool IsInactivePhaseload { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property IsInactivePhaseload As Boolean 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property bool IsInactivePhaseload { 	bool get (); 	void set (bool value); } ``` |

#### Field Value

true if the font is an inactive phase load cell; otherwise false.

# See Also

TableCellStyle Class

Autodesk.Revit.DB Namespace

#### ReportsFolder Property

---

|  |
| --- |
| EnergyDataSettings Class   See Also |

The folder path where all systems analysis reports are stored. It may include special label and relative path.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` public string ReportsFolder { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property ReportsFolder As String 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property String^ ReportsFolder { 	String^ get (); } ``` |

# See Also

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace

#### TemperatureRatingType Class

---

|  |
| --- |
| Members   See Also |

Represents temperature rating type definition information.

**Namespace:**   Autodesk.Revit.DB.Electrical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public class TemperatureRatingType : ElementType ``` |

| Visual Basic |
| --- |
| ``` Public Class TemperatureRatingType _ 	Inherits ElementType ``` |

| Visual C++ |
| --- |
| ``` public ref class TemperatureRatingType : public ElementType ``` |

# Remarks

Temperature rating type is defined based on corresponding wire material type. It includes type information such as wire size, insulation type, correction factor, etc. Only the temperature rating types which are retrieved from WireMaterialType can work well, so don't retrieve it from Revit document directly.

# Inheritance Hierarchy

System Object
  Autodesk.Revit.DB Element
  Autodesk.Revit.DB ElementType
  Autodesk.Revit.DB.Electrical TemperatureRatingType

# See Also

TemperatureRatingType Members

Autodesk.Revit.DB.Electrical Namespace

#### RebarElementRounding Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Rounding Overrides"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId RebarElementRounding { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property RebarElementRounding As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ RebarElementRounding { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### VerticalOffset Property

---

|  |
| --- |
| Camera Class   See Also |

Vertical offset of the camera's view center from target, measured at target distance.

**Namespace:**   Autodesk.Revit.DB.DirectContext3D
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public double VerticalOffset { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property VerticalOffset As Double 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property double VerticalOffset { 	double get (); 	void set (double value); } ``` |

# See Also

Camera Class

Autodesk.Revit.DB.DirectContext3D Namespace

#### MepPipeLowerObvertElevation Property

---

|  |
| --- |
| ParameterTypeId Class   See Also |

"Lower End Obvert Elevation"

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)

# Syntax

| C# |
| --- |
| ``` public static ForgeTypeId MepPipeLowerObvertElevation { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Shared ReadOnly Property MepPipeLowerObvertElevation As ForgeTypeId 	Get ``` |

| Visual C++ |
| --- |
| ``` public: static property ForgeTypeId^ MepPipeLowerObvertElevation { 	ForgeTypeId^ get (); } ``` |

# See Also

ParameterTypeId Class

Autodesk.Revit.DB Namespace

#### Definition Property

---

|  |
| --- |
| ViewSchedule Class   See Also |

The primary ScheduleDefinition.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public ScheduleDefinition Definition { get; } ``` |

| Visual Basic |
| --- |
| ``` Public ReadOnly Property Definition As ScheduleDefinition 	Get ``` |

| Visual C++ |
| --- |
| ``` public: property ScheduleDefinition^ Definition { 	ScheduleDefinition^ get (); } ``` |

# See Also

ViewSchedule Class

Autodesk.Revit.DB Namespace

#### IsValidValue Method (Color)

---

|  |
| --- |
| AssetPropertyDoubleArray4d Class   See Also |

Checks that the value is a valid value for this property.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018.1

# Syntax

| C# |
| --- |
| ``` public bool IsValidValue( 	Color color ) ``` |

| Visual Basic |
| --- |
| ``` Public Function IsValidValue ( _ 	color As Color _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool IsValidValue( 	Color^ color ) ``` |

#### Parameters

color
:   Type:  Autodesk.Revit.DB Color
     The value to be checked.

#### Return Value

True if the value is valid for the property.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | Cannot check validity for a property not being edited in AppearanceAssetEditScope. |

# See Also

AssetPropertyDoubleArray4d Class

IsValidValue Overload

Autodesk.Revit.DB.Visual Namespace

#### ExportSlabAsExtrusion Method

---

|  |
| --- |
| ExporterIFCUtils Class   See Also |

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public static bool ExportSlabAsExtrusion( 	ExporterIFC exporterIFC, 	Element pCeilingAndFloor, 	GeometryElement pGRep, 	IFCTransformSetter pTmpTrfSetter, 	IFCAnyHandle localPlacement, 	out IList<IFCAnyHandle> localPlacementAnyArr, 	out IList<IFCAnyHandle> reps, 	out IList<IList<CurveLoop>> extrusionLoops, 	out IList<IFCExtrusionCreationData> loopExtraParams, 	Plane plane ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function ExportSlabAsExtrusion ( _ 	exporterIFC As ExporterIFC, _ 	pCeilingAndFloor As Element, _ 	pGRep As GeometryElement, _ 	pTmpTrfSetter As IFCTransformSetter, _ 	localPlacement As IFCAnyHandle, _ 	<OutAttribute> ByRef localPlacementAnyArr As IList(Of IFCAnyHandle), _ 	<OutAttribute> ByRef reps As IList(Of IFCAnyHandle), _ 	<OutAttribute> ByRef extrusionLoops As IList(Of IList(Of CurveLoop)), _ 	<OutAttribute> ByRef loopExtraParams As IList(Of IFCExtrusionCreationData), _ 	plane As Plane _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: static bool ExportSlabAsExtrusion( 	ExporterIFC^ exporterIFC,  	Element^ pCeilingAndFloor,  	GeometryElement^ pGRep,  	IFCTransformSetter^ pTmpTrfSetter,  	IFCAnyHandle^ localPlacement,  	[OutAttribute] IList<IFCAnyHandle^>^% localPlacementAnyArr,  	[OutAttribute] IList<IFCAnyHandle^>^% reps,  	[OutAttribute] IList<IList<CurveLoop^>^>^% extrusionLoops,  	[OutAttribute] IList<IFCExtrusionCreationData^>^% loopExtraParams,  	Plane^ plane ) ``` |

#### Parameters

exporterIFC
:   Type:  Autodesk.Revit.DB.IFC ExporterIFC

pCeilingAndFloor
:   Type:  Autodesk.Revit.DB Element

pGRep
:   Type:  Autodesk.Revit.DB GeometryElement

pTmpTrfSetter
:   Type:  Autodesk.Revit.DB.IFC IFCTransformSetter

localPlacement
:   Type:  Autodesk.Revit.DB.IFC IFCAnyHandle

localPlacementAnyArr
:   Type:  System.Collections.Generic IList   IFCAnyHandle   %

reps
:   Type:  System.Collections.Generic IList   IFCAnyHandle   %

extrusionLoops
:   Type:  System.Collections.Generic IList   IList   CurveLoop   %

loopExtraParams
:   Type:  System.Collections.Generic IList   IFCExtrusionCreationData   %

plane
:   Type:  Autodesk.Revit.DB Plane

# See Also

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace

#### Dispose Method

---

|  |
| --- |
| IFCData Class   See Also |

Releases all resources used by the  IFCData

**Namespace:**   Autodesk.Revit.DB.IFC
  **Assembly:**   RevitAPIIFC  (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void Dispose() ``` |

| Visual Basic |
| --- |
| ``` Public Sub Dispose ``` |

| Visual C++ |
| --- |
| ``` public: virtual void Dispose() sealed ``` |

#### Implements

 IDisposable Dispose

# See Also

IFCData Class

Autodesk.Revit.DB.IFC Namespace

#### TransformParameterDomain Method

---

|  |
| --- |
| Transform1D Class   See Also |

Performs a transform of the parameter range defined by domain, and ensures that the domain is ordered correctly.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2021

# Syntax

| C# |
| --- |
| ``` public IList<double> TransformParameterDomain( 	double domainStart, 	double domainEnd ) ``` |

| Visual Basic |
| --- |
| ``` Public Function TransformParameterDomain ( _ 	domainStart As Double, _ 	domainEnd As Double _ ) As IList(Of Double) ``` |

| Visual C++ |
| --- |
| ``` public: IList<double>^ TransformParameterDomain( 	double domainStart,  	double domainEnd ) ``` |

#### Parameters

domainStart
:   Type:  System Double
     The original parameter domain start.

domainEnd
:   Type:  System Double
     The original parameter domain end.

# Remarks

If the domain is empty it is unchanged.

# See Also

Transform1D Class

Autodesk.Revit.DB Namespace

#### TooltipMessage Property

---

|  |
| --- |
| FamilyInstancePlacingArgs Class   See Also |

The message to be shown via tooltip

**Namespace:**   Autodesk.Revit.UI
  **Assembly:**   RevitAPIUI  (in RevitAPIUI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public string TooltipMessage { get; set; } ``` |

| Visual Basic |
| --- |
| ``` Public Property TooltipMessage As String 	Get 	Set ``` |

| Visual C++ |
| --- |
| ``` public: property String^ TooltipMessage { 	String^ get (); 	void set (String^ value); } ``` |

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also

FamilyInstancePlacingArgs Class

Autodesk.Revit.UI Namespace